In [35]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [3]:
series = Series([i * 10 for i in range(1, 9)])
print(series)
print('値', series.values)
print('添え字', series.index)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64
値 [10 20 30 40 50 60 70 80]
添え字 RangeIndex(start=0, stop=8, step=1)

In [4]:
data_frame = DataFrame(
    {
        'ID': ['100', '101', '102', '103', '104'],
        'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokaido', 'Tokyo'],
        'Birth_year': [1990, 1970, 1980, 1999, 2010],
        'Name': ['Hiroshi', 'Akio', 'Takashi', 'Yuki', 'Steve']
    }
)
print(data_frame)

    ID     City  Birth_year     Name
0  100    Tokyo        1990  Hiroshi
1  101    Osaka        1970     Akio
2  102    Kyoto        1980  Takashi
3  103  Hokaido        1999     Yuki
4  104    Tokyo        2010    Steve

In [5]:
# 行と列の入れ替え
data_frame.T

                  0      1        2        3      4
ID              100    101      102      103    104
City          Tokyo  Osaka    Kyoto  Hokaido  Tokyo
Birth_year     1990   1970     1980     1999   2010
Name        Hiroshi   Akio  Takashi     Yuki  Steve

In [6]:
data_frame["Birth_year"]

0    1990
1    1970
2    1980
3    1999
4    2010
Name: Birth_year, dtype: int64

In [7]:
data_frame[["City","Birth_year"]]

      City  Birth_year
0    Tokyo        1990
1    Osaka        1970
2    Kyoto        1980
3  Hokaido        1999
4    Tokyo        2010

In [8]:
data_frame[data_frame["City"] == "Tokyo"]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
4  104  Tokyo        2010    Steve

In [9]:
data_frame[data_frame["City"].isin(["Tokyo", 'Osaka'])]

    ID   City  Birth_year     Name
0  100  Tokyo        1990  Hiroshi
1  101  Osaka        1970     Akio
4  104  Tokyo        2010    Steve

In [10]:
# axis=1は列、axis=1は行
data_frame.drop(['Birth_year'], axis=1)
data_frame.T.drop(['Birth_year'], axis=0)

            0      1        2        3      4
ID        100    101      102      103    104
City    Tokyo  Osaka    Kyoto  Hokaido  Tokyo
Name  Hiroshi   Akio  Takashi     Yuki  Steve

In [11]:
data_frame

    ID     City  Birth_year     Name
0  100    Tokyo        1990  Hiroshi
1  101    Osaka        1970     Akio
2  102    Kyoto        1980  Takashi
3  103  Hokaido        1999     Yuki
4  104    Tokyo        2010    Steve

In [12]:
data_frame2 = DataFrame(
    {
        'ID': ['100', '101', '102', '105', '107'],
        'Math': [50, 40, 30, 20, 10],
        'English': [10, 20, 30, 40, 50],
        'Sex': ['M', 'F', 'F', 'M', 'M']
    }
)
data_frame2

    ID  Math  English Sex
0  100    50       10   M
1  101    40       20   F
2  102    30       30   F
3  105    20       40   M
4  107    10       50   M

In [13]:
pd.merge(data_frame, data_frame2)

    ID   City  Birth_year     Name  Math  English Sex
0  100  Tokyo        1990  Hiroshi    50       10   M
1  101  Osaka        1970     Akio    40       20   F
2  102  Kyoto        1980  Takashi    30       30   F

In [17]:
merged_data_frame = pd.merge(data_frame, data_frame2)

In [18]:
merged_data_frame.groupby('Sex')['Math'].mean()

Sex
F    35.0
M    50.0
Name: Math, dtype: float64

In [20]:
attribute = {
    'ID': ['100', '101', '102', '103', '104'],
    'City': ['Tokyo', 'Osaka', 'Kyoto', 'Hokaido', 'Tokyo'],
    'Birth_year': [1990, 1970, 1980, 1999, 2010],
    'Name': ['Hiroshi', 'Akio', 'Takashi', 'Yuki', 'Steve']
}
data_frame = DataFrame(attribute, index=['e', 'b', 'a', 'd', 'c'])

In [21]:
data_frame

    ID     City  Birth_year     Name
e  100    Tokyo        1990  Hiroshi
b  101    Osaka        1970     Akio
a  102    Kyoto        1980  Takashi
d  103  Hokaido        1999     Yuki
c  104    Tokyo        2010    Steve

In [22]:
data_frame.sort_index()

    ID     City  Birth_year     Name
a  102    Kyoto        1980  Takashi
b  101    Osaka        1970     Akio
c  104    Tokyo        2010    Steve
d  103  Hokaido        1999     Yuki
e  100    Tokyo        1990  Hiroshi

In [23]:
data_frame['Birth_year'].sort_values()

b    1970
a    1980
e    1990
d    1999
c    2010
Name: Birth_year, dtype: int64

In [37]:
data_frame['Name'] = np.nan
data_frame.isnull().sum()

ID            0
City          0
Birth_year    0
Name          5
dtype: int64

## 練習問題

In [40]:
attribute = {
    'ID': [str(i) for i in range(1, 6)],
    'Sex': ['F', 'F', 'M', 'M', 'F'],
    'Money': [1000, 2000, 500, 300, 700],
    'Name': ['Saito', 'Horie', 'Kondo', 'Kawada', 'Matusbara']
}
data_frame = DataFrame(attribute)

In [41]:
data_frame[data_frame['Money'] >= 500]

  ID Sex  Money       Name
0  1   F   1000      Saito
1  2   F   2000      Horie
2  3   M    500      Kondo
4  5   F    700  Matusbara

In [48]:
data_frame[data_frame['Money'] >= 500].groupby('Sex')['Money'].mean()

Sex
F    1233.333333
M     500.000000
Name: Money, dtype: float64

In [49]:
attribute2={
    'ID': ['3', '4', '7'],
    'Math': [60,30,40],
    'English': [80,20,30]
}
data_frame2 = DataFrame(attribute2)

In [58]:
merged_data_frame = data_frame.merge(data_frame2)
print('Moneyの平均', merged_data_frame['Money'].mean())
print('Mathの平均', merged_data_frame['Math'].mean())
print('Englishの平均', merged_data_frame['English'].mean())

Moneyの平均 400.0
Mathの平均 45.0
Englishの平均 50.0